package lesson16;

public class Lesson16 {

    // Graphs. Trees, Binary Trees, Tree Map.
    // Граф - это совокупность вершин (Vortex) и объединяющих их ребер (Edge).
    // Ребро - это соединение двух вершин.
    // Граф называется связным (fully connected) если из любой его вершины
    // можно добраться по ребрам для любой другой вершины

    // Граф называется циклическим (), если из какой-нибудь его вершины можно в нее попасть по ребрам

    // Граф называется деревом, если он является связным и ациклическим.

    // Лемма = утверждение: в дереве кол-во ребер равно кол-ву вершин минус один.

    // Бинарное дерево (Binary Trees) - это дерево, где у каждой вершины может быть максимум две дочерним вершины.

    //

}
